#ifndef _UI_H_
#define _UI_H_

void show_ui();   
void Register_Usr_UI();  //注册登录输入用户名和密码界面

/*------- 一级UI界面-------------------------------------*/
void init_UI_1();        //欢迎界面
void init_UI_2();        //选择 登录、创建账号或者退出 的界面

/*------- 二级UI界面-------------------------------------*/
void selete_Card();      //登入成功后选择信用卡 or 储蓄卡进行操作
void Register_UI();      //注册输入用户信息

/*------- 三级UI界面-------------------------------------*/
void Login_UI();         //打印登录输入用户名和密码界面

/*------- 四级UI界面-------------------------------------*/
void Cred_Menu_UI();     //登录成功后信用卡的操作界面
void Dep_Menu_UI();      //登录成功后储蓄卡的操作界面


#endif